[
    {
        "name": "Ertugrul Bey",
        "description": "Ertugrul is the father of Osman. With the small part of Kayi tribe, Ertugurl with only 400 tents, went on the challenging path toward the West and made foundation for one of the greatest empires. After Sultan Aleaddin was poisoned by Sadettin Kopek, he revolted against Kopek’s government, and proclaimed his own State,  the City of Sogut its capitol. His love and respect for his wife was widely known. He had four sons with Halime Sultan, and he died at 90 years old. The last ten years of his life were spent quietly in his tribe, when due to the old age, he transferred all his responsibilities to his youngest son Osman. A historical proof of his life are the coins minted by Osman which identify Ertuğrul as the name of his father, but beyond this not much is known about him apart from folktales.",
        "image_source": "https://www.trtertugrul.com/images/chars/char-1-thumbnail.jpg"
    },
    {
        "name": "Turgut Alp",
        "description": "He was one of the greatest and most renown warriors in Turkish history, a blood-brother to Ertugrul and his best follower and supporter, a very smart and capable man.He lived an unusually long life, even for our time. He outlived Erugrul Bey by 35 years, and he was killed in a battle, with his legendary battle-axe in his hand aged 125 years old! After Ertugrul passed away, Turgut become the main support to Osman, and when Osman established his Sultanate he rewarded Turgut with the highest position, as a Governor of the new State.",
        "image_source": "https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcQSK6aD2g91RMQl3OtGv8U7cn0QvHt7g_aUnqGPXm6IdNXcHDmY&usqp=CAU"
    },
    {
        "name": "Bamsi Alp",
        "description": "He was a legendary hero; his life has been described in the book of medieval Ottoman’s chronologies of that time, titled ‘’The book of Dede Korkut”. He was described as the two sworded fighter, a fierce warrior, goodhearted and very funny man. His love life was legendary, since his heart was divided between two loves. He spent 16 years in a dungeon in Byzantine, and the Princess, who lived in that Fortress fell in love with him and helped him escape. It is not known when he died or how long he lived; only that he lived fairly long for that time, and that he was ambushed by trickery and killed, leaving behind a wife and children. We may only guess how long this character will be kept in this series.",
        "image_source": "https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcSq5PgnzgeHua_xliRkDhtNPXk7aHKvSoGVYyqyCKzK_5QTd723&usqp=CAU"
    },
    {
        "name": "Dogan Alp",
        "description":"One of the three Alps of Ertuğrul, together with Turgut Alp and Bamsi Alp who were blood brothers with him. Very loyal and good-hearted. later married a hatun of the Dodurga tribe. A brave woman and skilled in swordsmanship. Dogan Alp dies in season 3 before the birth of his son, however not much is known about his character in the books written by the Ottomans. ",
        "image_source": "https://img.piri.net/mnresize/840/-/resim/imagecrop/2017/04/14/02/09/resized_f4a16-5fe9f0f8dirilisertugruldoganalpolecekmioldumudizidennedenayriliyor1.jpg"
    }
]